import images from "./images";

const menuItems = [
    {
        text: "Основные сведения",
        link: "f65d1c89-4bc0-4ac8-829b-7fa52807497e",
    },
    {
        text: "Структура и органы управления образовательной организацией",
        link: "f65d1c89-4bc0-4ac8-829b-7fa52807497",
    },
    {
        text: "Документы",
        link: "f65d1c89-4bc0-4ac8-829b-7fa5280749",
    },
    {
        text: "Образование",
        link: "f65d1c89-4bc0-4ac8-829b-7fa528074",
    },
    {
        text: "Руководство",
        link: "f65d1c89-4bc0-4ac8-829b-7fa52807",
    },
    {
        text: "Персональный состав педагогических работников",
        link: "f65d1c89-4bc0-4ac8-829b-7fa5280",
    },
    {
        text: "Материально-техническое обеспечение и оснащенность образовательного процесса",
        link: "f65d1c89-4bc0-4ac8-829b-7fa528",
    },
    {
        text: "Стипендии и иные виды материальной поддержки",
        link: "f65d1c89-4bc0-4ac8-829b-7fa52",
    },
    {
        text: "Финансово-хозяйственная деятельность",
        link: "f65d1c89-4bc0-4ac8-829b-7fa5",
    },
    {
        text: "Вакантные места для приема (перевода)",
        link: "f65d1c89-4bc0-4ac8-829b-7fa",
    },
    {
        text: "Сотрудники",
        link: "f65d1c89-4bc0-4ac8-829b-7f",
    },
    {
        text: "Об Учебном комбинате",
        link: "f65d1c89-4bc0-4ac8-829b-7",
    },
    {
        text: "Партнеры",
        link: "f65d1c89-4bc0-4ac8-829b",
    },
    {
        text: "Отзывы",
        link: "f65d1c89-4bc0-4ac8-829",
    },
    {
        text: "Реквизиты",
        link: "f65d1c89-4bc0-4ac8-82",
    },
    {
        text: "Отчеты АО «Учебный комбинат»",
        link: "f65d1c89-4bc0-4ac8-8",
    },
];

export default { menuItems };
